const websiteData = {
    "updateInfo": {
        "version": "v1.0.0",
        "date": "2026-09-07",
        "content": "• 오탈자 신고 및 문의사항 있으면 총괄에게 갠밴 주세요."
    },
    "menus": [
        {
            "id": "essential",
            "title": "필독",
            "submenus": [
                {
                    "id": "caution",
                    "title": "주의사항",
                    "content": "▫︎ 본 커뮤니티 [새빛대학교]는 성인가의 자캐 커뮤니티이며 모든 행위에 대한 책임은 오너 본인에게 있습니다."+ "<br>" + "▫︎ 러닝 중 발생할 수 있는 캐릭터들의 모든 비윤리적 언행에 대하여 운영진은 일절 옹호하지 않습니다."+ "<br>" + "▫︎ 캐릭터와 오너를 구분하지 못하는 분은 빠른 하차 바랍니다."
                },
                {
                    "id": "rules",
                    "title": "공통 규칙",
                    "content": "▫︎ " + "<span style='font-weight:bold'>" + "2006년생 이상 성인 여성 오너" + "</span>" + "만 해당 커뮤니티를 러닝할 수 있습니다. 연령과 성별을 거짓 기재 후 러닝한 사실이 발각될 경우 " + "<span style='color:red;font-weight:bold'>" + "강제 하차 " + "</span>" + "처리 됩니다." + "<br>" + "▫︎ 글 커뮤니티 | 조건부 무기한 | BL | 반막 | 플러팅"+ "<br>" + "▫︎ 방송통신심의위원회 SafeNet 등급기준 4424" + "<br>" + "▫︎ 첫커 불가 | 첫 밴커 불가" + "<br>" + "▫︎ 대한민국 표준시 기준 리얼 타임제"  + "<br>" + "▫︎ 반캐입방 필수 참여" + "<br>" + "▫︎ 개장을 위한 최소 인원: 40명" + "<br>" + "▫︎ 개장 전 반캐입방 사용 가능" + "<br>"  + "▫︎ 노트, QnA 개장 3일차부터 가능" + "<br>" + "▫︎ 1:1 채팅 개장 7일차부터 가능"
                },
                {
                    "id": "character",
                    "title": "캐릭터 설정",
                    "content": "▫︎ Only 대학생 남성 캐릭터" + "<br>" + "▫︎ 이름 한글로 기재" + "<br>" + "▫︎ 나이 20-25세" + "<br>" + "▫︎ 신장 180-210cm (소수점 금지)" + "<br>" + "▫︎ 불허: 컨트, 후타, 아방수, 유아퇴행, 사회성 부족, 다수의 인원이 불쾌감을 느낄 수 있는 모든 설정" + "<br>" + "▫︎ 캐릭터의 국적에 제한을 두지는 않으나 한국어로 원활한 소통이 가능해야 합니다." + "<br>" + "▫︎ 인장, 이름, 나이, 신장, 학과를 모두 갖춘 경우만 프로필 설정 완료로 간주합니다."+ "<br>" + "▫︎ 밴드 가입일로부터 2일 이내로 프로필 미설정 시 강제 탈퇴 처리 됩니다. 이 경우 재가입이 가능합니다."
                },
                {
                    "id": "profile",
                    "title": "인장",
                    "content": "▫︎ 허용 인장: 실사인장" + "<br>" + "▫︎ 비허용 : 무인장, 분위기 인장, 사용 금지 인장, 그림 인장, 모든 종류의 AI를 사용한 사진, 어린아이 혹은 여성의 사진"+ "<br>" + "▫︎ 인장 수위에 대한 안내" + "<br>" + "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;▸ 유두, 가슴골, 성기, 엉덩이, 항문이 노출되어서는 안 됩니다." + "<br>" + "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;▸ 지나치게 성적 어필을 암시하는 이미지도 자제해주세요." + "<br>" + "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;▸ 이는 러너 분들이 공공장소에서 알림을 확인할 수 있다는 점, 실존 인물의 노출 이미지에 대해 불쾌감을 느끼는 분들이 있을 수 있다는 점을 고려하여 마련된 규칙입니다."
                },
                {
                    "id": "warning",
                    "title": "러닝 중 금지사항",
                    "content": "▫︎ 공지 미준수" + "<br>" + "▫︎ 오너 정보 거짓 기재 (2006년생 이상 여성이 아닌 자)" + "<br>" + "▫︎ 운영진 중 최소 1인 이상을 포함하지 않은 3인 이상의 단체 채팅방을 러너가 임의로 개설하는 행위" + "<br>" + "▫︎ 러닝 중 n인밴드, 디스코드, 카카오톡 오픈채팅방, 온라인 게임 등 커뮤니티 인원을 외부로 유출하는 행위" + "<br>" + "▫︎ 특정 인원 간의 지나친 친목 행위" + "<br>" + "▫︎ 캐릭터성으로 인정할 수 없는 사회성 부족한 발언"  + "<br>" + "▫︎ 지나친 종합병원, 우울전시" + "<br>" + "▫︎ 관밍아웃 및 견제" + "<br>" + "▫︎ 어장" + "<br>" + "▫︎ 공개적인 장소에서 발생하는 모든 불화 및 분란" + "<br>" + "▫︎ 정치, 사회적 이슈에 대한 악의적인 분탕 발언" + "<br>" + "▫︎ 남성향 커뮤니티에서 유래된 여성혐오적 밈 사용 (자세한 사항은 소공지 [금지 용어 가이드라인] 항목 참조)"
                },
                {
                    "id": "report",
                    "title": "문의 및 신고",
                    "content": "▫︎ 신고 시에는 오너로써 정중하고 진중하게 찾아와주시기를 간곡히 부탁드립니다. 운영진은 자캐 커뮤니티를 실존하는 사람이 취미로 운영하는 것이며 오너님의 감정 쓰레기통이 아닙니다." + "<br>" + "▫︎ 건의해주신 모든 내용은 운영진 간에 공유될 수 있음을 유의해주십시오." + "<br>" + "▫︎ 오너님의 지극히 개인적인 상황이나 사적인 사정을 포함하지 마십시오. 운영진은 오너님의 건강상황, 가정사, 개인사 등에 대해 알 권리도 의무도 없습니다." + "<br>" + "▫︎ 운영진은 개인 간의 모든 분란 및 불화에 대해 책임지지 않으며 개입하지 않습니다. 해당 건에 대한 신고는 무시합니다. 부디 당사자 간의 원만한 합의 바랍니다."
                },
                {
                    "id": "social",
                    "title": "사회성에 대한 규정",
                    "content": "▫︎ 여기서 사회성이란 단순히 캐릭터의 까칠한 성격이나 언행을 의미하지 않습니다. 타인과의 쌍방 의사소통이 단절될 정도로 불쾌감을 유발하는 행위를 지칭합니다. 자캐 커뮤니티의 본질은 캐릭터들 사이 유기적인 상호작용, 커뮤니케이션이므로 이러한 성향은 단순 캐릭터성으로 용납될 수 없습니다." + "<br>" + "▫︎ 여러 사람과의 소통 속에서 감정이 상할 수 있으나, 그 감정을 제3자에게 전가하거나 해소 대상으로 삼는 등의 행위는 명백히 금지됩니다." + "<br>" + "▫︎ 자캐 커뮤니티는 취미 활동의 일환임을 인지해주십시오." + "<br>" + "▫︎ 본 커뮤니티는 수위 등급 4424로 러닝 중 수위 높은 언행이 다수 등장할 수 있습니다. 이러한 분위기에 크게 불쾌감을 느끼신다면 러닝을 재고해주십시오. 이에 관해서는 불편을 호소하셔도 운영진은 아무런 해결책을 드릴 수 없습니다." + "<br>" + "▫︎ 캐릭터가 소비되는 방식은 전적으로 오너님의 손에 달려있습니다. (예시: 우스운 행동을 하고 우스운 취급을 당했다고 억울해하며 운영진을 찾아오지 말아주십시오.)"
                }
            ]
        },
        {
            "id": "notice",
            "title": "소공지",
            "submenus": [
                {
                    "id": "post_rules",
                    "title": "게시글 활동 규정",
                    "content": "▫︎ " + "<span style='font-weight:bold'>" + "게시글 삭제 제한:" + "</span>" + " 게시한 지 48시간이 지나지 않은 글은 삭제가 불가능합니다." + "<br>" + "▫︎ " + "<span style='font-weight:bold'>" + "대화 이어가기:" + "</span>" + " 대댓글(역극)은 최소 3회 이상 주고받아 주십시오. 운영진은 수시로 모니터링하고 있습니다."
                },
                {
                    "id": "interaction",
                    "title": "편파 방지",
                    "content": "▫︎ 특정 인원에게만 반응하는 편파 행위와 게시글을 확인하고도 반응을 남기지 않는 행위(읽씹)를 지양해주십시오." + "<br>" + "▫︎ 게시글을 읽었다면 댓글을 남기기 어려운 상황이라도 표정 등을 통해 상호작용해 주십시오." + "<br>" + "▫︎ " + "<span style='font-weight:bold'>" + "위아래 글 챙기기:" + "</span>" + " 적어도 자신이 올린 게시글의 위, 아래 게시글에는 댓글을 작성할 것을 강력히 권장합니다." + "<br>" + "▫︎ 이는 제재 이전에 러너 간의 기본적 배려와 협조가 필수적인 사안입니다. 쾌적한 커뮤니티 환경을 위해 노력해주십시오."
                },
                {
                    "id": "banned_words",
                    "title": "금지 용어 가이드라인",
                    "content": "▫︎ 여성 혐오, 비하, 특정 남초 커뮤니티 유래 밈의 사용을 전면 금지합니다." + "<br>" + "▫︎ 대중매체에서 널리 쓰이는 표준적인 용어를 제외하고, 아래 예시에 포함되거나 유사한 뉘앙스의 단어 사용 시 경고 조치될 수 있습니다." + "<br><br>" + 
                    "▸ " + "<span style='font-weight:bold'>" + "남초 커뮤니티 용어 및 말투:" + "</span>" + " 눈나, 누나 나 죽어, 자 드가자, 앙 기모띠, 게이야, ~노/~이기 (및 변칙 사용 일체), ~데수웅, ~인 거시와요, 몰?루, 쥬지, 뷰지, 근첩, 완장질, 닥눈삼, 헤으응, 응기잇, 야스/야발 등 야갤 용어 일체" + "<br>" +
                    "▸ " + "<span style='font-weight:bold'>" + "여성 혐오 표현:" + "</span>" + " 피싸개, 피분수, 설거지론, 퐁퐁남, 퐁퐁녀, 맘충, 줌마/개줌마, 된장녀, 김치녀, 꽃뱀, 갈보년 등" + "<br>" +
                    "▸ " + "<span style='font-weight:bold'>" + "일베/정치/지역/고인 비하:" + "</span>" + " 운지, 슨상님/홍어/과메기(지역 비하 목적), ㅁㅈㅎ(민주화 비하), 노무노무, 응디, 기분 좋다, 삼일한, 전차스 등" + "<br><br>" +
                    "<span style='color:red'>" + "※" + "</span>" + " 본인이 사용하는 단어가 혐오 표현이나 특정 커뮤니티 용어인지 몰랐더라도 면책 사유가 되지 않습니다. 성인으로서 스스로 사용하는 언어의 유래와 의미를 숙지하고 주의해 주십시오."
                },
                {
                    "id": "trans",
                    "title": "캐릭터 변경",
                    "content": "▫︎ 캐릭터 변경은 현재 캐릭터로 활동하기 시작한 일자부터 14일 이후 가능합니다."  + "<br>" + "▫︎ 캐릭터 변경 시에는 반드시 운영진에게 신고 바랍니다. (통보 가능)" + "<br>" + "▫︎ 변경 횟수에 별도의 제한은 없지만 잦은 캐릭터 변경은 권장하지 않습니다."
                },
                {
                    "id": "profile2",
                    "title": "인장 가공",
                    "content": "▫︎ 소위 '프꾸'로 지칭되는 행위를 허가하지 않습니다." + "<br>" + "▫︎ 본 커뮤니티에서 사용하시는 인장에 크롭이나 보정 이외의 어떠한 2차적 가공도 거치지 말아주십시오."
                },
                {
                    "id": "profile3",
                    "title": "프로필 스토리",
                    "content": "▫︎ 스토리에는 수위 허용 범위나 지뢰, 지향/지양하는 행위, 캐릭터에 대한 간단한 정보 등을 기입할 수 있습니다."  + "<br>" + "▫︎ 오너의 개인 사정(학교생활, 직장, 건강 등)을 추가하지 않습니다." + "<br>" + "▫︎ 타인의 프로필에 \"좋아요\"를 누르지 않습니다." + "<br>" + "▫︎ 타인의 스토리에 표정이나 댓글을 남기지 않습니다."
                },
                {
                    "id": "chat_room",
                    "title": "반캐입방",
                    "content": "▫︎ 읽음 수 확인 후 인사 잘하기. 되도록 먼저 인사하기" + "<br>" + "▫︎ 수위 발언, 자보드립 가능하지만 적당히" + "<br>" + "▫︎ 읽음 4인 이상일 때 답장 기능, 단타(한 줄에 쓸 수 있는 문장을 여러 번 끊어 보내는 행위) 자제하기" + "<br>" + "▫︎ 모두가 함께할 수 있는 이야기 하기 / 대화 주제 물어보면 친절하게 대답해주기" + "<br>" + "▫︎ 주기적으로 대화 주제 환기하기" + "<br>" + "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;▸ 예시: 한 시간 전에도 가슴 얘기 하고 있었는데 한 시간 후에 다시 와도 가슴 얘기 하고 있음 (X)" + "<br>" + "▫︎ 노림수, 편파, 물타기, 지인플, 종합병원 및 우울전시, 대학생이라는 설정에 지나치게 어긋나는 오너 개입 금지" + "<br>" + "▫︎ 상호 의사소통이 불가능할 정도로 특정 주제, 단어, 행위 등에 꽂혀 무지성으로 반복하는 행위 금지" + "<br>" + "▫︎ 밤티 나데나데 금지. 편파로 경고 안 줄 테니까 알아서 먹금들 하세요."
                },
                {
                    "id": "note",
                    "title": "노트",
                    "content": "▫︎ #note 해시태그를 사용하여 주십시오." + "<br>" + "▫︎ 1인 1노트를 원칙으로 합니다. 새 노트는 기존 노트를 게시한지 72시간이 지나고 삭제한 후 재게시 가능합니다." + "<br>" + "▫︎ 노트에 작성하는 내용에 규제는 따로 없지만, 사람의 신체 부위가 지나치게 드러나는 수위가 높은 사진이나 불쾌감을 유발할 수 있는 표현을 미리보기 방지 없이 게재하거나 비밀 댓글 기능을 사용하지 않는 것에 관해서는 불허합니다."
                },
                {
                    "id": "qna",
                    "title": "QnA",
                    "content": "▫︎ #qna 해시태그를 사용하여 주십시오." + "<br>" + "▫︎ 1인 1QnA를 원칙으로 합니다. 새 QnA는 기존 글을 게시한지 72시간이 지나고 삭제한 후 재게시 가능합니다." + "<br>" + "▫︎ 질문 시 [러닝 중 금지사항]의 모든 항목을 어기지 않도록 주의해주십시오." + "<br>" + "▫︎ 첫인상/현인상 같은 질문은 지양하도록 합니다."
                },
            ]
        }
    ]

};


